benchmark/threadserver.txt
Transactions:              20000 hits
Availability:             100.00 %
Elapsed time:               7.98 secs
Data transferred:           0.00 MB
Response time:              0.02 secs
Transaction rate:        2506.27 trans/sec
Throughput:             0.00 MB/sec
Concurrency:               47.82
Successful transactions:       20000
Failed transactions:               0
Longest transaction:            1.68
Shortest transaction:           0.00